results/res/h200_h200_disagg_32b_image8_1080p_numprompt32/test_sglang_multi_rates_1080p_20260515_043428/rate_1.0/results.txt
/opt/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1080x1920) with 512 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_h200_disagg_32b_image8_1080p_numprompt32/test_sglang_multi_rates_1080p_20260515_043428/rate_1.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_h200_disagg_32b_image8_1080p_numprompt32/test_sglang_multi_rates_1080p_20260515_043428/rate_1.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 1050500
#Output tokens: 7474
#Total images: 512
#Images per request: 8 (fixed)

Created 64 random jpeg images with average 16723186 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 64/64 [03:21<00:00,  3.15s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     38        
Benchmark duration (s):                  201.48    
Total input tokens:                      624081    
Total input text tokens:                 3313      
Total input vision tokens:               620768    
Total generated tokens:                  4136      
Total generated tokens (retokenized):    4134      
Request throughput (req/s):              0.19      
Input token throughput (tok/s):          3097.41   
Output token throughput (tok/s):         20.53     
Peak output token throughput (tok/s):    778.00    
Peak concurrent requests:                38        
Total token throughput (tok/s):          3117.94   
Concurrency:                             32.05     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   169942.39 
Median E2E Latency (ms):                 177822.73 
P90 E2E Latency (ms):                    193973.16 
P99 E2E Latency (ms):                    196840.54 
---------------Time to First Token----------------
Mean TTFT (ms):                          94710.09  
Median TTFT (ms):                        95738.43  
P99 TTFT (ms):                           139548.76 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          3089.56   
Median TPOT (ms):                        620.91    
P99 TPOT (ms):                           50507.82  
---------------Inter-Token Latency----------------
Mean ITL (ms):                           716.46    
Median ITL (ms):                         38.43     
P95 ITL (ms):                            99.83     
P99 ITL (ms):                            3103.07   
Max ITL (ms):                            160965.05 
==================================================